from mod_sort import *

lst_1 = [21, 33, 5, 87, 9, 12, 57, 37]
print(f"{'Список до сортування:':<30}", lst_1)
lst_1 = sort_bubble(lst_1)
print(f"{'Сортування методом бульбашок:':<30}", lst_1)

lst_2 = [12, 99, 35, 47, 21, 68, 6]
print(f"{'Список до сортування:':<30}", lst_2)
lst_2 = sort_choice(lst_2)
print(f"{'Сортування методом вибору:':<30}", lst_2)

lst_3 = [99, 35, 23, 59, 84, 5, 12, 49, 47]
print(f"{'Список до сортування:':<30}", lst_3)
lst_3 = sort_quick(lst_3)
print(f"{'Швидке сортування:':<30}", lst_3)
